docs/blog/on-hope.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2022-05-10 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>On hope</title>
<meta name="generator" content="Org mode">
<meta name="keywords" content="reflections">
<link rel="stylesheet" href="/static/site.css"/><link rel="icon" type="image/x-icon" href="/static/favicon.ico"/></head>
<body>
<header id="top" class="status">
<div class="nav">
  <ul id="navlinks" class="horizontal-list">
    <li>
      <a href="/">Home</a>
    </li>
    <li>
      <a href="/blog/index.html">Blog</a>
    </li>
    <li>
      <a href="/page/about.html">About</a>
    </li>
  </ul>
</div>
</header>
<main id="content">
<header>
<h1 class="title">On hope</h1>
</header><p>
Picture something about the world that made you sad or revolted
recently.
</p>

<p>
(I&rsquo;m sure you can think of plenty of examples.)
</p>

<p>
If you&rsquo;re anything like me, it&rsquo;s not just the event itself that
bothers you, but also the fact that it shouldn&rsquo;t have happened at
all. I mean the kind of event that has already happened several times
in history (maybe in slightly different forms), and given the benefit
of hindsight, that we humans should have been past that already.
</p>

<p>
I can tell myself that maybe people do realise the problem with what
they are doing, but they feel they are being forced into that course
of action regardless, but that&rsquo;s not what I want to talk about. What I
want to talk about is about avoiding hopelessness.<aside>It is
my impression that this has been increasingly difficult lately, but
that's a very subjective view.</aside>
</p>
</main>
</body>
</html>
